; domain
(define (domain blocksworld)
  (:requirements :strips :constraints :negative-preconditions)
  (:predicates (pred_2 ?v3)
               (pred_4 ?v3)
               (pred_1)
               (pred_3 ?v3)
               (pred_5 ?v3 ?v2))

  (:action op_4
    :parameters (?v4)
    :precondition (and (pred_2 ?v4) (pred_4 ?v4) (pred_1))
    :effect (and (pred_3 ?v4) (not (pred_2 ?v4)) (not (pred_4 ?v4)) 
                 (not (pred_1))))

  (:action op_3
    :parameters  (?v4)
    :precondition (pred_3 ?v4)
    :effect (and (pred_2 ?v4) (pred_1) (pred_4 ?v4) 
                 (not (pred_3 ?v4))))

  (:action op_2
    :parameters  (?v4 ?v1)
    :precondition (and (pred_2 ?v1) (pred_3 ?v4))
    :effect (and (pred_1) (pred_2 ?v4) (pred_5 ?v4 ?v1)
                 (not (pred_2 ?v1)) (not (pred_3 ?v4))))

  (:action op_1
    :parameters  (?v4 ?v1)
    :precondition (and (pred_5 ?v4 ?v1) (pred_2 ?v4) (pred_1))
    :effect (and (pred_3 ?v4) (pred_2 ?v1)
                 (not (pred_5 ?v4 ?v1)) (not (pred_2 ?v4)) (not (pred_1)))))

; problem
(define (problem BW-rand-5)
(:domain blocksworld)
(:objects obj_04 obj_03 obj_02 obj_01 obj_05 )
(:init
(pred_1)
(pred_5 obj_04 obj_01)
(pred_5 obj_03 obj_04)
(pred_4 obj_02)
(pred_5 obj_01 obj_05)
(pred_5 obj_05 obj_02)
(pred_2 obj_03)
)
(:goal
(and
(pred_5 obj_04 obj_02)
(pred_5 obj_01 obj_04)
(pred_5 obj_05 obj_03))
)

(:constraints
  (sometime-before (pred_5 obj_01 obj_04) (pred_5 obj_04 obj_02))
)
)

; plan
1. (op_1 obj_03 obj_04)
   deleted: (pred_5 obj_03 obj_04) (pred_2 obj_03) (pred_1)
   added: (pred_3 obj_03) (pred_2 obj_04)
   goals met: 0 of 3
2. (op_3 obj_03)
   deleted: (pred_3 obj_03)
   added: (pred_2 obj_03) (pred_1) (pred_4 obj_03)
   goals met: 0 of 3
3. (op_1 obj_04 obj_01)
   deleted: (pred_5 obj_04 obj_01) (pred_2 obj_04) (pred_1)
   added: (pred_3 obj_04) (pred_2 obj_01)
   goals met: 0 of 3
4. (op_3 obj_04)
   deleted: (pred_3 obj_04)
   added: (pred_2 obj_04) (pred_1) (pred_4 obj_04)
   goals met: 0 of 3
5. (op_1 obj_01 obj_05)
   deleted: (pred_5 obj_01 obj_05) (pred_2 obj_01) (pred_1)
   added: (pred_3 obj_01) (pred_2 obj_05)
   goals met: 0 of 3
6. (op_3 obj_01)
   deleted: (pred_3 obj_01)
   added: (pred_2 obj_01) (pred_1) (pred_4 obj_01)
   goals met: 0 of 3
7. (op_1 obj_05 obj_02)
   deleted: (pred_5 obj_05 obj_02) (pred_2 obj_05) (pred_1)
   added: (pred_3 obj_05) (pred_2 obj_02)
   goals met: 0 of 3
8. (op_2 obj_05 obj_03)
   deleted: (pred_2 obj_03) (pred_3 obj_05)
   added: (pred_1) (pred_2 obj_05) (pred_5 obj_05 obj_03)
   goals met: 1 of 3
9. (op_4 obj_04)
   deleted: (pred_2 obj_04) (pred_4 obj_04) (pred_1)
   added: (pred_3 obj_04)
   goals met: 1 of 3
10. (op_2 obj_04 obj_02)
   deleted: (pred_2 obj_02) (pred_3 obj_04)
   added: (pred_1) (pred_2 obj_04) (pred_5 obj_04 obj_02)
   goals met: 2 of 3
11. (op_4 obj_01)
   deleted: (pred_2 obj_01) (pred_4 obj_01) (pred_1)
   added: (pred_3 obj_01)
   goals met: 2 of 3
12. (op_2 obj_01 obj_04)
   deleted: (pred_2 obj_04) (pred_3 obj_01)
   added: (pred_1) (pred_2 obj_01) (pred_5 obj_01 obj_04)
   goals met: 3 of 3
